In [1]:
import numpy as np
import pandas as pd

# Generate Tables

In [2]:
districts = ['East Forests', 'North Mountains', 'South Deserts', 'West Steppes']
min_count = 1000
max_count = 10000

## Generate environments table

In [3]:
environment_cols = ['Urban', 'Suburban', 'Rural']

In [4]:
df_environment = pd.DataFrame()
df_environment['District'] = districts
for col in environment_cols:
    df_environment[col] = np.random.randint(min_count, max_count, size=len(districts))
df_environment

          District  Urban  Suburban  Rural
0     East Forests   3866      1510   6397
1  North Mountains   3438      5779   8250
2    South Deserts   6971      4941   1544
3     West Steppes   3169      7188   5289

## Generate df_all table 
That table contains info about sum people for every district

In [5]:
df_all = df_environment[['District']].copy()
df_all['All'] = df_environment[environment_cols].sum(axis=1)
df_all

          District    All
0     East Forests  11773
1  North Mountains  17467
2    South Deserts  13456
3     West Steppes  15646

## Generate employment table

In [6]:
employment_cols = ['Agriculture', 'Industry', 'Production', 'Service']

In [7]:
df_employment = df_all.copy()
for col in employment_cols[:-1]:
    df_employment[col] = np.random.randint(df_employment['All'] // len(employment_cols[:-1]))
df_employment[employment_cols[-1]] = df_employment['All'] - df_employment[employment_cols[:-1]].sum(axis=1)
df_employment = df_employment[np.append('District', employment_cols)]
df_employment

          District  Agriculture  Industry  Production  Service
0     East Forests         2063      3644         504     5562
1  North Mountains         1258      3807         862    11540
2    South Deserts          677      4051        2699     6029
3     West Steppes         3309        66         275    11996

## Generate family status table

In [8]:
family_statuses = ['Single', 'Marriged', 'Widower']
sexes = ['Female', 'Male']

In [9]:
df_family = pd.DataFrame()
df_family['District'] = df_all['District'].repeat(2)
df_family['Sex'] = np.concatenate([sexes for district in districts])
df_family['Deviation'] = np.random.randint(-df_all['All'].values//8, df_all['All'].values//8).repeat(2) 
df_family['Deviation'] *= np.concatenate([[-1, 1] for district in districts])
df_family['Deviation'] += np.logical_and((df_family['Sex'] == 'Male'), (df_all['All'].repeat(2) % 2 != 0))
df_family['All'] = df_all['All'].repeat(2)//2 + df_family['Deviation']
for col in family_statuses[:-1]:
    df_family[col] = np.random.randint(df_family['All'] // len(family_statuses[:-1]) // 2, 
                                       df_family['All'] // len(family_statuses[:-1]))
df_family[family_statuses[-1]] = df_family['All'] - df_family[family_statuses[:-1]].sum(axis=1)
df_family = df_family[np.concatenate([['District', 'Sex'], family_statuses])]
df_family

          District     Sex  Single  Marriged  Widower
0     East Forests  Female    2545      2248      314
0     East Forests    Male    1702      2920     2044
1  North Mountains  Female    3059      3352      617
1  North Mountains    Male    3207      4578     2654
2    South Deserts  Female    3197      2526     1516
2    South Deserts    Male    1899      1693     2625
3     West Steppes  Female    3032      2312     1988
3     West Steppes    Male    3756      3652      906

# Save generated tables

In [10]:
df_environment.to_csv('environment.csv', index=False)
df_employment.to_csv('employment.csv', index=False)
df_family.to_csv('family.csv', index=False)

# Show saved tables

In [11]:
df_environment = pd.read_csv('environment.csv')
df_environment

          District  Urban  Suburban  Rural
0     East Forests   3866      1510   6397
1  North Mountains   3438      5779   8250
2    South Deserts   6971      4941   1544
3     West Steppes   3169      7188   5289

In [12]:
df_employment = pd.read_csv('employment.csv')
df_employment

          District  Agriculture  Industry  Production  Service
0     East Forests         2063      3644         504     5562
1  North Mountains         1258      3807         862    11540
2    South Deserts          677      4051        2699     6029
3     West Steppes         3309        66         275    11996

In [13]:
df_family = pd.read_csv('family.csv')
df_family

          District     Sex  Single  Marriged  Widower
0     East Forests  Female    2545      2248      314
1     East Forests    Male    1702      2920     2044
2  North Mountains  Female    3059      3352      617
3  North Mountains    Male    3207      4578     2654
4    South Deserts  Female    3197      2526     1516
5    South Deserts    Male    1899      1693     2625
6     West Steppes  Female    3032      2312     1988
7     West Steppes    Male    3756      3652      906